app/Controllers/StudentController.php

    public function addStudent(){
       $data = ["username"=>"kaif",
       "email"=>"kaif@gmail.com",
       "password"=>"kaif123"];
       $this->studentModelobject->insert($data);
---
INSERT INTO `student` (`username`, `email`, `password`) VALUES ('kaif', 'kaif@gmail.com', 'kaif123')

    public function updateStudent(){
         $data = [
       "email"=>"kaif25@gmail.com",
       "password"=>"kaif1234"];
              $this->studentModelobject->update(3,$data);
---
UPDATE `student` SET `email` = 'kaif25@gmail.com', `password` = 'kaif1234'
WHERE `student`.`id` IN (3)